app/controllers/sites_controller.rb

	def player
		@current_track = session[:current_track]
		@tracks = Track.all
---
SELECT "tracks".* FROM "tracks" ORDER BY "tracks"."id" ASC LIMIT 1

	def play_next

		# check to make sure there is at least one song in q to play
		if Track.count >= 1
			# set now playing track to next track in q
			current_track = Track.first
			session[:current_track], @current_track = current_track.title

			# remove now playing track from q
			current_track.destroy				# LATER, may want to archive this, move to a play history
---
SELECT "tracks".* FROM "tracks" ORDER BY "tracks"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "tracks"
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]

  def add_song
  	# add this song to the users personal list (history)
    new_song = Song.create(title: params[:title], status: "added to My Q!")
    current_user.songs << new_song

    # add this song to the player queue (tracks)
    Track.create(title: params[:title], user_id: current_user.id)
---
INSERT INTO "songs" ("created_at", "status", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 04 Feb 2014 20:18:08 UTC +00:00], ["status", "added to My Q!"], ["title", "Elvis Pressly and America"], ["updated_at", Tue, 04 Feb 2014 20:18:08 UTC +00:00]]
INSERT INTO "tracks" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 04 Feb 2014 20:18:08 UTC +00:00], ["title", "Elvis Pressly and America"], ["updated_at", Tue, 04 Feb 2014 20:18:08 UTC +00:00], ["user_id", 2]]