app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "role", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    new_user = params.require(:user).permit(:name, :email, :role, :password, :password_confirmation)
    new_user[:role] = 'listener'  # TODO hard code role for now (change to enum, manage via UI)
    @user = User.new(new_user)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    user = User.find(params[:id])
    sign_out
    user.destroy