app/views/sites/index.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = ?  [["user_id", 3]]
---
			</tr>
   			<% @current_user.songs.each do |song| %>